//IBMVSCP  JOB 'FA',MSGLEVEL=(1,1),MSGCLASS=H,CLASS=A,
//       NOTIFY=&SYSUID
//*
//APPEL   EXEC IGYWCL,PARM.COBOL=(ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN   DD DISP=SHR,DSN=API3.SOURCE.COBOL(PROJVSAM)
//COBOL.SYSLIB  DD DISP=SHR,DSN=API3.SOURCE.COPY
                DD DSN=CEE.SCEESAMP,DISP=SHR
//LKED.SYSLMOD  DD DSN=API3.COBOL.LOAD,DISP=(SHR,KEEP,KEEP)
//LKED.SYSIN    DD *
 NAME  PROJVSAM(R)
/*
