//API3A JOB (),API3,CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,MSGLEVEL=(1,1),
//           TIME=(,1)
//*
//DELETE   EXEC  PGM=IEFBR14
//SORTIE  DD DSN=API3.ACTIF.SEQ1,DISP=(OLD,DELETE,DELETE)
//*
//ALLOC1 EXEC  PGM=IEFBR14
//SORTIE  DD DSN=API3.ACTIF.SEQ1,DISP=(NEW,CATLG,DELETE),
//           DCB=(LRECL=80,BLKSIZE=23200,RECFM=FB),
//           SPACE=(TRK,(2,1)),UNIT=SYSDA
