//API3J   JOB (),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID                      00010000
//DELETE EXEC PGM=IEFBR14
//SYSUT2  DD  DSN=API3.ACTIF.SEQ2,DISP=(OLD,DELETE,DELETE)
//*
//ALLO  EXEC PGM=IEBGENER
//SYSUT1  DD DSN=API3.ACTIF.SEQ1,DISP=SHR
//SYSUT2  DD DSN=API3.ACTIF.SEQ2,DISP=(NEW,CATLG,DELETE),
//           DCB=(LRECL=80,BLKSIZE=23200,RECFM=FB),
//           SPACE=(TRK,(2,1)),UNIT=SYSDA
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//*
