//API3K JOB (),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//*
//ALLOC EXEC  PGM=IEBGENER
//SYSUT1  DD  DSN=API3.ACTIF.SEQ1,DISP=SHR
//*LA PREMIERE FOIS QU'ON LANCE il faut DECOMMENTER la ligne 6,8 ET9
//*SYSUT2  DD  DSN=API3.ACTIF.PDS1(TEST1),DISP=(NEW,CATLG,DELETE),
//SYSUT2  DD  DSN=API3.ACTIF.PDS1(TEST1),DISP=SHR
//*           DCB=(LRECL=80,BLKSIZE=23200,RECFM=FB),
//*         SPACE=(TRK,(2,1,3)),UNIT=SYSDA
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
