//API3K    JOB (),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//*
//* DELETE  EXEC  PGM=IEFBR14
//*        DD    DNS=API3.ACTIF.SEQ3,DISP=(OLD,DELETE,DELETE)
//*
//STEP1    EXEC PGM=IEBGENER
//SYSUT1   DD DSN=API3.ACTIF.PDS1(TEST1),DISP=SHR
//SYSUT2   DD DSN=API3.ACTIF.SEQ3,DISP=(NEW,CATLG,DELETE),
//         DCB=(LRECL=80,BLKSIZE=23200,RECFM=FB),
//         SPACE=(TRK,(2,1,0)),UNIT=SYSDA
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
