//API3K JOB (),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//*
//ALLOC EXEC PGM=IEBGENER
//SYSUT1  DD DSN=API3.ACTIF.PDS1(TEST1),DISP=SHR
//SYSUT2  DD DSN=API3.ACTIF.PDS1(TEST2),DISP=SHR,
//        DCB=(LRECL=80,BLKSIZE=23200,RECFM=FB),
//        SPACE=(TRK,(2,1,1)),UNIT=SYSDA
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
