//API3K JOB (),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//*
//ALLOC EXEC  PGM=IEBGENER
//SYSUT1 DD  DSN=API3.ACTIF.PDS1(TEST2),DISP=SHR
//SYSUT2 DD  SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
