//API3K JOB (),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//*
//ALLOC EXEC  PGM=IEBGENER
//SYSUT1 DD  DSN=API3.ACTIF.PDS1,DISP=SHR
//SYSUT2 DD  DSN=API3.ACTIF.PDS1(TEST3),DISP=SHR
//SYSPRINT DD DSN=API3.SOURCE.JCL(TEST3),DISP=SHR
//*SYSPRINT DD DSN=API3.SOURCE.JCL(TEST3),DISP=(NEW,CATLG,DELETE),
//*    DCB=(LRECL=80,BLKSIZE=23200,RECFM=FB),
//*     SPACE=(TRK,(2,1,2)),UNIT=SYSDA
//SYSIN    DD DUMMY
