//API3K JOB (),CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//*
//S10    EXEC  PGM=IEFBR14
//F1    DD DSN=API3.COB.ASSUREST,DISP=(OLD,DELETE,DELETE)
//*
//STEP01 EXEC PGM=SORT
//SYSOUT DD SYSOUT=*
//SORTIN DD DSN=API3.COB.ASSURES,DISP=SHR
//SORTOUT DD DSN=API3.COB.ASSUREST,DISP=(NEW,CATLG,DELETE),
//        DCB=(LRECL=80,BLKSIZE=23200,RECFM=FB),
//        SPACE=(TRK,(2,1,0)),UNIT=SYSDA
//SYSIN    DD *
  SORT FIELDS=(1,6,CH,A)
//*
