//API3J JOB (),API3,CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,
//            TYPRUN=SCAN
//S4    EXEC  PGM=IEFBR14
//F1    DD DSN=API3.COB.ASSURES,
//         DISP=SHR
//*
